n5/src/Catalogs/Organizations/Organizations.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Organizations</name>
  <basedOn>Catalog.Leads</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Address</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>Alien</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Birthday</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Birthplace</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>Chain</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>CodeFiscal</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Contact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerContract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerType</name>
    <type>
      <types>EnumRef.CustomerTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Fax</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullDescription</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>Government</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>GroupsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>Individual</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Issued</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IssuedBy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ItemsUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Lead</name>
    <type>
      <types>CatalogRef.Leads</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Number</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ObjectUsage</name>
    <type>
      <types>EnumRef.PropertiesUsage</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentContact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>Phone</name>
    <type>
      <types>DefinedType.Phone</types>
    </type>
  </attributes>
  <attributes>
    <name>Policy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RegistrationDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Salesman</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShippingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>ShippingContact</name>
    <type>
      <types>CatalogRef.Contacts</types>
    </type>
  </attributes>
  <attributes>
    <name>SIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxGroup</name>
    <type>
      <types>CatalogRef.TaxGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidTo</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Vendor</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>VendorContract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Web</name>
    <type>
      <types>DefinedType.Web</types>
    </type>
  </attributes>
  <attributes>
    <name>Wholesaler</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ApprovalList</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
    <attributes>
      <name>Priority</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Properties</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.Properties</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.Properties</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/Enums/CustomerTypes/CustomerTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CustomerTypes</name>
  <enumValues>
    <name>Wholesaler</name>
  </enumValues>
  <enumValues>
    <name>Branch</name>
  </enumValues>
  <enumValues>
    <name>Chain</name>
  </enumValues>
  <enumValues>
    <name>ChainRetailer</name>
  </enumValues>
  <enumValues>
    <name>IndependentWholesaler</name>
  </enumValues>
  <enumValues>
    <name>Dispensary</name>
  </enumValues>
  <enumValues>
    <name>IndependentRetailer</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
</mdclass:Enum>

n5/src/Enums/Access/Access.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Access</name>
  <enumValues>
    <name>Undefined</name>
  </enumValues>
  <enumValues>
    <name>Allow</name>
  </enumValues>
  <enumValues>
    <name>Forbid</name>
  </enumValues>
  <enumValues>
    <name>States</name>
  </enumValues>
  <enumValues>
    <name>Directly</name>
  </enumValues>
</mdclass:Enum>

n5/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>AccessDenied</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccessRevoked</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ApproveSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeInternalOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ChangeSalesOrders</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DefinedType.Email</types>
    </type>
  </attributes>
  <attributes>
    <name>Employee</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Gender</name>
    <type>
      <types>EnumRef.Sex</types>
    </type>
  </attributes>
  <attributes>
    <name>Language</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LastName</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Login</name>
    <type>
      <types>CatalogRef.Logins</types>
    </type>
  </attributes>
  <attributes>
    <name>OrganizationAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <attributes>
    <name>OSAuth</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>OSUser</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Patronymic</name>
    <type>
      <types>DefinedType.Name</types>
    </type>
  </attributes>
  <attributes>
    <name>Protection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Show</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TimeZone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingDistance</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TrackingPeriodicity</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingProvider</name>
    <type>
      <types>EnumRef.Providers</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackingTime</name>
    <type>
      <types>EnumRef.Frequency</types>
    </type>
  </attributes>
  <attributes>
    <name>TrackLocation</name>
    <type>
      <types>EnumRef.Tracking</types>
    </type>
  </attributes>
  <attributes>
    <name>UserClass</name>
    <type>
      <types>EnumRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>WarehouseAccess</name>
    <type>
      <types>EnumRef.Access</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Companies</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Organizations</name>
    <attributes>
      <name>Organization</name>
      <type>
        <types>CatalogRef.Organizations</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>OrganizationsStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Warehouses</name>
    <attributes>
      <name>Warehouse</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WarehousesStates</name>
    <attributes>
      <name>State</name>
      <type>
        <types>CatalogRef.States</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

n5/src/Catalogs/Organizations/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var DescriptionChanged;
	
Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( IsFolder ) then
		return;
	endif; 
	if ( not checkApprovalDoubles () ) then
		Cancel = true;
	endif; 
	if ( not checkEmail () ) then
		Cancel = true;
	endif; 
	if ( not PhoneTemplates.Check ( ThisObject, "Phone, Fax" ) ) then
		Cancel = true;
	endif; 
	checkCustomer ( CheckedAttributes );
	
EndProcedure

Function checkApprovalDoubles ()
	
	doubles = Collections.GetDoubles ( ApprovalList, "User" );
	if ( doubles.Count () > 0 ) then
		for each row in doubles do
			Output.DoublesApprovalList ( , Output.Row ( "ApprovalList", row.LineNumber, "User" ) );
		enddo; 
		return false;
	endif; 
	return true;
	
EndFunction 

Function checkEmail ()
	
	if ( IsBlankString ( Email ) ) then
		return true;
	endif; 
	result = Mailboxes.TestAddress ( Email );
	if ( not result ) then
		Output.InvalidEmail ( , "Email" );
	endif; 
	return result;
	
EndFunction 

Procedure checkCustomer ( CheckedAttributes )
	
	if ( not Customer ) then
		return;
	endif;
	CheckedAttributes.Add ( "CustomerType" );
	if ( CustomerType = Enums.CustomerTypes.Branch ) then
		CheckedAttributes.Add ( "Wholesaler" );
	endif;
	if ( CustomerType = Enums.CustomerTypes.ChainRetailer ) then
		CheckedAttributes.Add ( "Chain" );
	endif; 
	
EndProcedure 

Procedure BeforeWrite ( Cancel )
	
	if ( DataExchange.Load ) then
		recheckEmail ();
		return;
	endif; 
	defaultName ();
	DescriptionChanged = Description <> DF.Pick ( Ref, "Description", "" );

EndProcedure

Procedure recheckEmail ()
	
	if ( IsFolder or Email = "" ) then
		return;
	endif; 
	result = Mailboxes.TestAddress ( Email );
	if ( not result ) then
		Email = "";
	endif; 
	
EndProcedure

Procedure defaultName ()
	
	if ( Description = "" ) then
		Description = Output.WorkingDescription ();
	endif; 
	
EndProcedure 

Procedure OnWrite ( Cancel )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	if ( not checkApprovingUsers () ) then
		Cancel = true;
		return;
	endif;
	if ( DescriptionChanged ) then
		EmbeddingGetter.Enroll ( Ref );
	endif;
	
EndProcedure

Function checkApprovingUsers ()
	
	if ( DeletionMark ) then
		return true;
	endif; 
	table = getNotAuthorizedUsers ();
	if ( table.Count () > 0 ) then
		for each row in table do
			Output.UserCannotApprove ( new Structure ( "Customer", Description ), Output.Row ( "ApprovalList", row.LineNumber, "User" ) );
		enddo; 
		return false;
	endif; 
	return true;
	
EndFunction 

Function getNotAuthorizedUsers ()
	
	s = "
	|select ApprovalList.User as User, ApprovalList.LineNumber as LineNumber
	|from Catalog.Organizations.ApprovalList as ApprovalList
	|	//
	|	// Organizations
	|	//
	|	left join Catalog.Users.Organizations as Organizations
	|	on Organizations.Ref = ApprovalList.User
	|	and Organizations.Organization = &Ref
	|where ApprovalList.Ref = &Ref
	|and ApprovalList.User.OrganizationAccess = value ( Enum.Access.Allow )
	|and Organizations.Organization is null
	|union
	|select ApprovalList.User, ApprovalList.LineNumber
	|from Catalog.Organizations.ApprovalList as ApprovalList
	|	//
	|	// Organizations
	|	//
	|	left join Catalog.Users.Organizations as Organizations
	|	on Organizations.Ref = ApprovalList.User
	|	and Organizations.Organization = &Ref
	|where ApprovalList.Ref = &Ref
	|and ApprovalList.User.OrganizationAccess = value ( Enum.Access.Forbid )
	|and Organizations.Organization is not null
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	table = q.Execute ().Unload ();
	return table;
	
EndFunction 

#endif
